[Killed] BlockStatement
src/main/utils/sectionUtils.js:81:43
 };
 
 // Takes an entire section row and returns whether the section is full
-export const isSectionFull = (section) => {
-  return section.enrolledTotal >= section.maxEnroll;
-};
+export const isSectionFull = (section) => {};
 
 // Takes an entire section row and returns whether the section is closed
killedBy: Section tests Sections have appropriate status columns
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  FULL
Received:
  OPEN

[Killed] ConditionalExpression
src/main/utils/sectionUtils.js:82:10
 
 // Takes an entire section row and returns whether the section is full
 export const isSectionFull = (section) => {
-  return section.enrolledTotal >= section.maxEnroll;
+  return true;
 };
 
killedBy: Section tests Has the expected cell values when expanded
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  OPEN
Received:
  FULL

[Killed] BlockStatement
src/main/utils/sectionUtils.js:86:45
 };
 
 // Takes an entire section row and returns whether the section is closed
-export const isSectionClosed = (section) => {
-  return section.classClosed !== null;
-};
+export const isSectionClosed = (section) => {};
 
 // Takes an entire section row and returns whether the section is cancelled
killedBy: Section tests Sections have appropriate status columns
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  CLOSED
Received:
  FULL

[Killed] ConditionalExpression
src/main/utils/sectionUtils.js:87:10
 
 // Takes an entire section row and returns whether the section is closed
 export const isSectionClosed = (section) => {
-  return section.classClosed !== null;
+  return true;
 };
 
killedBy: Section tests Has the expected cell values when expanded
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  OPEN
Received:
  CLOSED

[Killed] BlockStatement
src/main/utils/sectionUtils.js:91:48
 };
 
 // Takes an entire section row and returns whether the section is cancelled
-export const isSectionCancelled = (section) => {
-  return section.courseCancelled !== null;
-};
+export const isSectionCancelled = (section) => {};
 
 export const isSection = (en1) => {
killedBy: Section tests Sections have appropriate status columns
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  CANCELLED
Received:
  FULL
