[Killed] StringLiteral
main/components/BasicCourseSearch/CourseOverTimeInstructorSearchForm.js:70:22
               quarter={endQuarter}
               setQuarter={setEndQuarter}
               controlId={"CourseOverTimeInstructorSearch.EndQuarter"}
-              label={"End Quarter"}
+              label={""}
             />
           </Col>
killedBy: CourseOverTimeInstructorSearchForm tests when I select an end quarter, the state for end quarter changes
statusReason: TestingLibraryElementError: Unable to find a label with the text of: End Quarter

<body>
  <div>
    <form
      class=""
    >
      <div
