[Killed] BooleanLiteral
main/components/Sections/SectionsTable.js:20:66
   return values[0];
 }
 
-export default function SectionsTable({ sections, isInstructor = false }) {
+export default function SectionsTable({ sections, isInstructor = true }) {
   // Stryker enable all
   // Stryker disable BooleanLiteral
killedBy: Section tests Correctly groups separate lectures of the same class
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  ➕ MATH 3B
Received:
  MATH 3B
