[Killed] ConditionalExpression
src/main/components/SectionsTableBase.js:81:32
                               {...row.getToggleRowExpandedProps()}
                               data-testid={`${testid}-cell-row-${cell.row.index}-col-${cell.column.id}-expand-symbols`}
                             >
-                              {row.subRows.length > 1 && !isInstructor
+                              {false
                                 ? row.isExpanded
                                   ? "➖ "
killedBy: Section tests Correctly groups separate lectures of the same class
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  ➕ MATH 3B
Received:
  MATH 3B

[Killed] LogicalOperator
src/main/components/SectionsTableBase.js:81:32
                               {...row.getToggleRowExpandedProps()}
                               data-testid={`${testid}-cell-row-${cell.row.index}-col-${cell.column.id}-expand-symbols`}
                             >
-                              {row.subRows.length > 1 && !isInstructor
+                              {row.subRows.length > 1 || !isInstructor
                                 ? row.isExpanded
                                   ? "➖ "
killedBy: SectionsTableBase tests renders a single lecture section correctly
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <span data-testid="testid-cell-row-0-col-courseInfo.courseId-expand-symbols" style="cursor: pointer;" title="Toggle Row Expanded">➕ </span> instead
