[Survived] BooleanLiteral
main/pages/CourseOverTime/CourseOverTimeInstructorIndexPage.js:43:60
         <CourseOverTimeInstructorSearchForm
           fetchJSON={fetchCourseOverTimeJSON}
         />
-        <SectionsTable sections={courseJSON} isInstructor={true} />
+        <SectionsTable sections={courseJSON} isInstructor={false} />
       </div>
     </BasicLayout>
