[Killed] ObjectLiteral
main/components/Sections/SectionsOverTimeTable.js:130:5
       aggregate: getFirstVal,
       Aggregated: ({ cell: { value } }) => `${value}`,
     },
-    {
-      Header: "Info",
-      accessor: (row) =>
-        `/course/details/${row.courseInfo.quarter}/${row.section.enrollCode}`,
-      disableGroupBy: true,
-      id: "info",
-
-      aggregate: getFirstVal,
-      Cell: ({ cell: { value } }) => (
-        <Button variant="outline-dark" size="sm" href={value}>
-          ⓘ
-        </Button>
-      ),
-      Aggregated: ({ cell: { value } }) => (
-        <Button variant="outline-light" size="sm" href={value}>
-          ⓘ
-        </Button>
-      ),
-    },
+    {},
   ];
 
killedBy: Section tests renders without crashing for empty table
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ArrowFunction
main/components/Sections/SectionsOverTimeTable.js:132:17
     },
     {
       Header: "Info",
-      accessor: (row) =>
-        `/course/details/${row.courseInfo.quarter}/${row.section.enrollCode}`,
+      accessor: () => undefined,
       disableGroupBy: true,
       id: "info",
killedBy: Section tests Has the expected column headers and content
statusReason: Error: expect(received).toMatch(expected)

Matcher error: received value must be a string

Received has value: undefined
