[Killed] BlockStatement
src/main/pages/DeveloperPage.js:6:29
 import DeveloperTable from "main/components/Developer/DeveloperTable";
 
 import { useBackend } from "main/utils/useBackend";
-const DeveloperPage = () => {
-  const {
-    data: commits,
-    error: _error,
-    status: _status,
-  } = useBackend(
-    // Stryker disable next-line all : don't test internal caching of React Query
-    ["/api/systemInfo"],
-    {
-      // Stryker disable next-line StringLiteral : GET is default, so replacing with "" is an equivalent mutation
-      method: "GET",
-      url: "/api/systemInfo",
-    },
-    [],
-  );
-
-  return (
-    <BasicLayout>
-      <h2>Commits</h2>
-      <DeveloperTable commits={commits} />
-    </BasicLayout>
-  );
-};
+const DeveloperPage = () => {};
 
 export default DeveloperPage;
killedBy: DeveloperPage tests renders without crashing
statusReason: Error: DeveloperPage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] ObjectLiteral
src/main/pages/DeveloperPage.js:14:5
   } = useBackend(
     // Stryker disable next-line all : don't test internal caching of React Query
     ["/api/systemInfo"],
-    {
-      // Stryker disable next-line StringLiteral : GET is default, so replacing with "" is an equivalent mutation
-      method: "GET",
-      url: "/api/systemInfo",
-    },
+    {},
     [],
   );
killedBy: DeveloperPage tests renders without crashing
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  4a3d0f9b2c23e2e4a1c1d3e4f5b6a7d8b9c0e1f2
Received:

[Killed] StringLiteral
src/main/pages/DeveloperPage.js:17:12
     {
       // Stryker disable next-line StringLiteral : GET is default, so replacing with "" is an equivalent mutation
       method: "GET",
-      url: "/api/systemInfo",
+      url: "",
     },
     [],
killedBy: DeveloperPage tests renders without crashing
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  4a3d0f9b2c23e2e4a1c1d3e4f5b6a7d8b9c0e1f2
Received:
