[Killed] ObjectLiteral
main/components/Developer/DeveloperTable.js:9:3
     Header: "Commit Sha",
     accessor: "commitSha",
   },
-  {
-    Header: "Commit message",
-    accessor: "commitMessage",
-  },
+  {},
 ];
 
killedBy: DeveloperPage tests renders without crashing
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Developer/DeveloperTable.js:11:15
   },
   {
     Header: "Commit message",
-    accessor: "commitMessage",
+    accessor: "",
   },
 ];
killedBy: DeveloperPage tests renders without crashing
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="DeveloperTable-cell-row-0-col-commitMessage"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] BlockStatement
main/components/Developer/DeveloperTable.js:15:53
   },
 ];
 
-export default function DeveloperTable({ commits }) {
-  return (
-    <OurTable data={[commits]} columns={columns} testid={"DeveloperTable"} />
-  );
-}
+export default function DeveloperTable({ commits }) {}
 
killedBy: DeveloperPage tests renders without crashing
statusReason: Error: DeveloperTable(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] ArrayDeclaration
main/components/Developer/DeveloperTable.js:17:21
 
 export default function DeveloperTable({ commits }) {
   return (
-    <OurTable data={[commits]} columns={columns} testid={"DeveloperTable"} />
+    <OurTable data={[]} columns={columns} testid={"DeveloperTable"} />
   );
 }
killedBy: DeveloperPage tests renders without crashing
statusReason: Error: Unable to find an element by: [data-testid="DeveloperTable-cell-row-0-col-commitSha"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav
