[Killed] BlockStatement
main/components/Sections/SectionsTable.js:18:30
 } from "main/utils/sectionUtils.js";
 import { Button } from "react-bootstrap";
 
-function getFirstVal(values) {
-  //Get first value
-  return values[0];
-}
+function getFirstVal(values) {}
 
 export default function SectionsTable({ sections }) {
killedBy: Section tests Has the expected cell values when expanded
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  W22
Received:
  undefined

[Killed] ArrowFunction
main/components/Sections/SectionsTable.js:92:17
     },
     {
       Header: "Section Number",
-      accessor: (row) => row.section.section,
+      accessor: () => undefined,
       // Stryker disable next-line StringLiteral: this column is hidden, very hard to test
       id: "sectionNumber",
killedBy: Section tests Has the expected column headers and content
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  0100
Received:
  undefined

[Killed] ObjectLiteral
main/components/Sections/SectionsTable.js:98:5
       aggregate: getFirstVal,
       Aggregated: ({ cell: { value } }) => `${value}`,
     },
-    {
-      Header: "Days",
-      accessor: (row) => formatDays(row.section.timeLocations),
-      disableGroupBy: true,
-      id: "days",
-
-      aggregate: getFirstVal,
-      Aggregated: ({ cell: { value } }) => `${value}`,
-    },
+    {},
     {
       Header: "Time",
killedBy: Section tests renders without crashing for empty table
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ObjectLiteral
main/components/Sections/SectionsTable.js:133:5
       aggregate: getFirstVal,
       Aggregated: ({ cell: { value } }) => `${value}`,
     },
-    {
-      Header: "Info",
-      accessor: (row) =>
-        `/coursedetails/${row.courseInfo.quarter}/${row.section.enrollCode}`,
-      disableGroupBy: true,
-      id: "info",
-
-      aggregate: getFirstVal,
-      Cell: ({ cell: { value } }) => (
-        <Button variant="outline-dark" size="sm" href={value}>
-          ⓘ
-        </Button>
-      ),
-      Aggregated: ({ cell: { value } }) => (
-        <Button variant="outline-light" size="sm" href={value}>
-          ⓘ
-        </Button>
-      ),
-    },
+    {},
   ];
 
killedBy: Section tests renders without crashing for empty table
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ArrowFunction
main/components/Sections/SectionsTable.js:135:17
     },
     {
       Header: "Info",
-      accessor: (row) =>
-        `/coursedetails/${row.courseInfo.quarter}/${row.section.enrollCode}`,
+      accessor: () => undefined,
       disableGroupBy: true,
       id: "info",
killedBy: Section tests Has the expected column headers and content
statusReason: Error: expect(received).toMatch(expected)

Matcher error: received value must be a string

Received has value: undefined

[Killed] StringLiteral
main/components/Sections/SectionsTable.js:136:9
     {
       Header: "Info",
       accessor: (row) =>
-        `/coursedetails/${row.courseInfo.quarter}/${row.section.enrollCode}`,
+        ``,
       disableGroupBy: true,
       id: "info",
killedBy: Section tests Has the expected column headers and content
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /\/coursedetails\/20221\/12583$/
Received string:  "http://localhost/"

[Killed] ArrowFunction
main/components/Sections/SectionsTable.js:141:13
       id: "info",
 
       aggregate: getFirstVal,
-      Cell: ({ cell: { value } }) => (
-        <Button variant="outline-dark" size="sm" href={value}>
-          ⓘ
-        </Button>
-      ),
+      Cell: () => undefined,
       Aggregated: ({ cell: { value } }) => (
         <Button variant="outline-light" size="sm" href={value}>
killedBy: Section tests Has the expected cell values when expanded
statusReason: Error: Component(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] ArrowFunction
main/components/Sections/SectionsTable.js:146:19
           ⓘ
         </Button>
       ),
-      Aggregated: ({ cell: { value } }) => (
-        <Button variant="outline-light" size="sm" href={value}>
-          ⓘ
-        </Button>
-      ),
+      Aggregated: () => undefined,
     },
   ];
killedBy: Section tests Has the expected cell values when expanded
statusReason: Error: Component(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.
