[Killed] ObjectLiteral
src/main/components/SectionsTableBase.js:14:7
   // Stryker disable next-line ObjectLiteral
   const { getTableProps, getTableBodyProps, headerGroups, rows, prepareRow } =
     useTable(
-      {
-        initialState: {
-          groupBy: ["courseInfo.courseId"],
-          hiddenColumns: [],
-        },
-        columns,
-        data,
-      },
+      {},
       useGroupBy,
       useExpanded,
killedBy: Section Searches Index Page tests renders without crashing
statusReason: TypeError: Cannot read properties of undefined (reading 'map')
