[Killed] ConditionalExpression
main/components/PersonalSchedules/PersonalScheduleDropdown.js:25:9
     localStorage.setItem(controlId, selectedSchedule);
     setScheduleState(selectedSchedule);
     setSchedule(selectedSchedule);
-    if (onChange != null) {
+    if (true) {
       onChange(event);
     }
killedBy: CourseForm tests No Error messages on good input
statusReason: TypeError: onChange is not a function

[Killed] BlockStatement
main/components/PersonalSchedules/PersonalScheduleDropdown.js:38:45
         value={scheduleState}
         onChange={handleScheduleOnChange}
       >
-        {schedules.map(function (object, i) {
-          const key = `${controlId}-option-${i}`;
-          return (
-            <option key={key} data-testid={key} value={object.id}>
-              {yyyyqToQyy(object.quarter)} {object.name}
-            </option>
-          );
-        })}
+        {schedules.map(function (object, i) {})}
       </Form.Control>
     </Form.Group>
killedBy: SingleSubjectDropdown tests when I select an object, the value changes
statusReason: TestingLibraryElementError: Value "1" not found in options

Ignored nodes: comments, <script />, <style />
<select
  class="form-control"
  id="psd3"
/>
