[Killed] BooleanLiteral
main/components/PersonalSchedules/PersonalSchedulesTable.js:13:17
 
 export default function PersonalSchedulesTable({
   personalSchedules,
-  showButtons = true,
+  showButtons = false,
 }) {
   const navigate = useNavigate();
killedBy: UserTable tests Has the expected colum headers and content for Ordinary User
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="PersonalSchedulesTable-cell-row-0-col-Edit-button"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] BlockStatement
main/components/PersonalSchedules/PersonalSchedulesTable.js:17:34
 }) {
   const navigate = useNavigate();
 
-  const editCallback = (cell) => {
-    navigate(`/personalschedules/edit/${cell.row.values.id}`);
-  };
+  const editCallback = (cell) => {};
 
   const detailsCallback = (cell) => {
killedBy: UserTable tests Edit button navigates to the edit page for Ordinary user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/personalschedules/edit/1"

Number of calls: 0

<html>
  <head />

[Killed] BlockStatement
main/components/PersonalSchedules/PersonalSchedulesTable.js:21:37
     navigate(`/personalschedules/edit/${cell.row.values.id}`);
   };
 
-  const detailsCallback = (cell) => {
-    navigate(`/personalschedules/details/${cell.row.values.id}`);
-  };
+  const detailsCallback = (cell) => {};
   // Stryker disable all : hard to test for query caching
   const deleteMutation = useBackendMutation(
killedBy: UserTable tests Edit button navigates to the details page for Ordinary user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/personalschedules/details/1"

Number of calls: 0

<html>
  <head />

[Killed] StringLiteral
main/components/PersonalSchedules/PersonalSchedulesTable.js:22:14
   };
 
   const detailsCallback = (cell) => {
-    navigate(`/personalschedules/details/${cell.row.values.id}`);
+    navigate(``);
   };
   // Stryker disable all : hard to test for query caching
killedBy: UserTable tests Edit button navigates to the details page for Ordinary user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/personalschedules/details/1"
Received: ""

Number of calls: 1

<html>
