[Killed] ArrowFunction
main/pages/Courses/PSCourseCreatePage.js:8:31
 import { toast } from "react-toastify";
 
 export default function CoursesCreatePage() {
-  const objectToAxiosParams = (course) => ({
-    url: "/api/courses/post",
-    method: "POST",
-    params: {
-      enrollCd: course.enrollCd,
-      psId: course.psId,
-    },
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (course) => {
killedBy: CoursesCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] StringLiteral
main/pages/Courses/PSCourseCreatePage.js:10:13
 export default function CoursesCreatePage() {
   const objectToAxiosParams = (course) => ({
     url: "/api/courses/post",
-    method: "POST",
+    method: "",
     params: {
       enrollCd: course.enrollCd,
killedBy: CoursesCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] BlockStatement
main/pages/Courses/PSCourseCreatePage.js:17:33
     },
   });
 
-  const onSuccess = (course) => {
-    toast(`New course Created - id: ${course.id} enrollCd: ${course.enrollCd}`);
-  };
+  const onSuccess = (course) => {};
 
   const mutation = useBackendMutation(
killedBy: CoursesCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New course Created - id: 17 enrollCd: 08250"
Received: "useBackend: Error communicating with backend via GET on /api/personalschedules/all: Error: Request failed with status code 404"

Number of calls: 1

[Killed] StringLiteral
main/pages/Courses/PSCourseCreatePage.js:18:11
   });
 
   const onSuccess = (course) => {
-    toast(`New course Created - id: ${course.id} enrollCd: ${course.enrollCd}`);
+    toast(``);
   };
 
killedBy: CoursesCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New course Created - id: 17 enrollCd: 08250"
Received
       1: "useBackend: Error communicating with backend via GET on /api/personalschedules/all: Error: Request failed with status code 404"
       2: ""

Number of calls: 2

[Killed] BlockStatement
main/pages/Courses/PSCourseCreatePage.js:30:36
 
   const { isSuccess } = mutation;
 
-  const onSubmit = async (data) => {
-    const psId = {
-      psId: localStorage["CourseForm-psId"],
-    };
-    const dataFinal = Object.assign(data, psId);
-    console.log(dataFinal);
-    mutation.mutate(dataFinal);
-  };
+  const onSubmit = async (data) => {};
 
   if (isSuccess) {
killedBy: CoursesCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] StringLiteral
main/pages/Courses/PSCourseCreatePage.js:32:26
 
   const onSubmit = async (data) => {
     const psId = {
-      psId: localStorage["CourseForm-psId"],
+      psId: localStorage[""],
     };
     const dataFinal = Object.assign(data, psId);
killedBy: CoursesCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "enrollCd": "08250",
-   "psId": "13",

[Killed] BlockStatement
main/pages/Courses/PSCourseCreatePage.js:39:18
     mutation.mutate(dataFinal);
   };
 
-  if (isSuccess) {
-    return <Navigate to="/courses/list" />;
-  }
+  if (isSuccess) {}
   if (mutation.isError) {
     return (
killedBy: CoursesCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: {"to": "/courses/list"}

Number of calls: 0

[Killed] BlockStatement
main/pages/Courses/PSCourseCreatePage.js:42:25
   if (isSuccess) {
     return <Navigate to="/courses/list" />;
   }
-  if (mutation.isError) {
-    return (
-      <BasicLayout>
-        <div className="pt-2">
-          <h1>Create New Course</h1>
-
-          <CourseForm submitAction={onSubmit} />
-          <p data-testid="PSCourseCreate-Error">
-            Error: {mutation.error.response.data?.message}
-          </p>
-        </div>
-      </BasicLayout>
-    );
-  }
+  if (mutation.isError) {}
   return (
     <BasicLayout>
killedBy: CoursesCreatePage tests when you input incorrect information, we get an error
statusReason: Error: Unable to find an element by: [data-testid="PSCourseCreate-Error"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ConditionalExpression
main/pages/Courses/PSCourseCreatePage.js:42:7
   if (isSuccess) {
     return <Navigate to="/courses/list" />;
   }
-  if (mutation.isError) {
+  if (false) {
     return (
       <BasicLayout>
killedBy: CoursesCreatePage tests when you input incorrect information, we get an error
statusReason: Error: Unable to find an element by: [data-testid="PSCourseCreate-Error"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] OptionalChaining
main/pages/Courses/PSCourseCreatePage.js:50:21
 
           <CourseForm submitAction={onSubmit} />
           <p data-testid="PSCourseCreate-Error">
-            Error: {mutation.error.response.data?.message}
+            Error: {mutation.error.response.data.message}
           </p>
         </div>
killedBy: CoursesCreatePage tests when you input incorrect information, we get an error
statusReason: TypeError: Cannot read properties of undefined (reading 'message')
